In [ ]:
X = [[1, 7, 3],
             [3, 5, 6],
             [6, 8, 9]]
       Y = [[1, 1, 1, 2],
           [6, 7, 3, 0],
           [4, 5, 9, 1]]
#mul X * Y

In [1]:
import pandas as pd
import numpy as np

In [2]:
X = [[1, 7, 3],[3, 5, 6],[6, 8, 9]]
Y = [[1, 1, 1, 2],[6, 7, 3, 0],[4, 5, 9, 1]]
#mul X * Y

In [4]:
df_x = pd.DataFrame(X)
df_x

   0  1  2
0  1  7  3
1  3  5  6
2  6  8  9

In [6]:
df_y = pd.DataFrame(Y)
df_y

   0  1  2  3
0  1  1  1  2
1  6  7  3  0
2  4  5  9  1

In [12]:
x1 = df_x.iloc[0,:]
y1 = df_y.iloc[:,0]

0    1
1    7
2    3
Name: 0, dtype: int64

In [13]:
x11 = np.sum(x1*y1)

In [ ]:
x_arr =[]
for i in range(len(x1)):
    for j in range(len(y1)):
        x1_arr[i] = x1_arr.append(df_x.iloc[i,:]*df_y.iloc[:,j])

In [14]:
numbers = [    
    386, 462, 47, 418, 907, 344, 236, 375, 823, 566, 597, 978, 328, 615, 953, 345, 
    399, 162, 758, 219, 918, 237, 412, 566, 826, 248, 866, 950, 626, 949, 687, 217, 
    815, 67, 104, 58, 512, 24, 892, 894, 767, 553, 81, 379, 843, 831, 445, 742, 717, 
    958,743, 527
    ]

In [22]:
# all number which are after 67
flag=0
for i,value in enumerate(numbers):
    if value==67:
        flag =1
    if flag==1:
        print(value)

67
104
58
512
24
892
894
767
553
81
379
843
831
445
742
717
958
743
527